[
  {
    "resume_id": "RES_0",
    "filename": "AARADHI KS.pdf",
    "raw_text": "AARADHI KS +91-9188657765 PROFILE aaradhiks04@gmail.com Dedicated individual with vast knowledge and experience. Currently Linkedln looking for job position in organization where I can grow professionally and personally. I wish to improve and expand my knowledge, skills and GitHub establishing and employment in a friendly environment. Secure a responsible career opportunity to fully utilize my training and skills, while EDUCATION making a significant contribution to the success. 2021 - 2025 INTERNSHIP BE.COMPUTER SCIENCE AND ENGINEERING FLUTTER Bethlahem Institute of engineering karungal Company : Spectrum Softtech Solutions Pvt Ltd Duration : 15 Days CGPA: 7.64 2019 - 2021 PYTHON FULL STACK WEB DEVELOPMENT H S C Company : Webking Technology GVHSS Valappad Duration : 1 Month 2018 - 2019 SSLC PROJECT EXPERIENCE SH OF MCGHS Kandassankadavu Developed a Todo App with task categorization,reminders and SKILLS persistent storage,using Flutter and Dart for a smooth IOS and android experience Python basic Developed Whatsapp with messaging,media sharing,and contact Flutter(Dart) management,built with Flutter and Firebase UI design Developed a High Secure Finance Web Application using UX design blockchain,AES-256,ECC,and SHA-3,integrating post-quantum cryptography for enhanced data security and scalability. LANGUAGES English WORKSHOP Malayalam Tamil Three Days workshop on \"DATASCIENCE USING PYTHON\" VOLUNTARY conducted by VEI TECHNOLOGIES PRIVATE LIMITED ACTIVITY One Day workshop on \"MOBILE APPLICATION National Service Scheme (NSS) DEVELOPMENT\" conducted by FOXTON RESEARCH. Bethlahem Institute of Engineering,karungal,2021- 2025 Education cleaning campus"
  },
  {
    "resume_id": "RES_1",
    "filename": "Abhay S.pdf",
    "raw_text": "ABHAY S +919497682446|abhayabhi239@gmail.com LinkedIn | GitHub SUMMARY Motivated and detail-oriented BCA graduate with a solid foundation in web development and programming skills. Quick learner with strong analytical and problem-solving abilities. Recognized for innovation, teamwork, and a commitment of excellence in both academic and professional setting. Passionate about technology and eager to apply skills in real-world projects to contribute to organizational success. EDUCATION Bachelor of Computer Applications Sep 2022 - Jun 2025 New Horizon College | Bangalore Bachelor of Vocation (IT Diploma) Oct 2021 - Aug 2022 Tata Institute of Social Science | Mumbai SKILLS SUMMARY EXPERIENCE DataScience Intern EduPheonix Solutions Jan 2025 - Feb 2025 Worked on dataanalysis using Python, NumPy, and Pandas. Built a Parkinson’s disease prediction system using machine learning libraries. Provided technical support for data management and analysis. Web Designing Intern FocSkill Pvt Ltd Feb 2022 - Mar 2022 PROJECTS Parkinsons Disease Prediction Developed a web-based system for predicting Parkinson's disease. Users can upload patient test data and get real-time results. Implemented using Python (NumPy, Pandas, Scikit-Learn). Improved accessibility and accuracy in healthcare diagnostics. [Project Link] Placement-Cell-Web-App CERTIFICATIONS Software Testing Nov 2024 Institution: New Horizon College IOT Mar 2024 Institution: New Horizon College DevOps Jan 2024 Institution: New Horizon College Android App Development Dec 2022 Institution: New Horizon College"
  },
  {
    "resume_id": "RES_2",
    "filename": "ABHIJITH V.pdf",
    "raw_text": "ABHIJITH V Software Developer 8590980599 abhijithvkumar02@gmail.com EDUCATION OBJECTIVE Master of Computer Applications Mar Athanasios College For To secure a challenging position as a Software Developer where I Advanced Studies (MACFAST) Thiruvalla can utilize my programming knowledge, problem-solving abilities, Mahatma G a n d h i U n iversity and academic training in computer applications to contribute to 2023-2025 the growth of the organization while continuing to learn and grow Bachelor of Computer Applications professionally. Amrita Vishwa Vidyapeetham Amritapuri Kollam Amrita University PROJECTS 2020-2023 12th Grade (Higher Secondary) College Project: Labour India Public School 2018 – 2020 Designed and implemented a salon reservation 10th Grade (Secondary School) Labour India Public School system to streamline appointment scheduling 2017 – 2018 Built an online used car website for browsing, filtering, and comparing car listings with secure user SKILLS accounts and a user-friendly interface. Developed a web-based system to manage faculty, Python parents, and students, including record C maintenance and communication modules. MERN PHP CERTIFICATES Java Python Basics certificate - University of Michigan LANGUAGE DataBase Management System Certificate - NPTEL Python Fundamentals certificate - CIR, Amrita English Vishwa Vidyapeetham, Coimbatore Malayalam - Native Language"
  },
  {
    "resume_id": "RES_3",
    "filename": "Abhishek S Kumar.pdf",
    "raw_text": "Abhishek S Kumar Karakkat harinilayam house po Edakalathur ,thrissur ,kerala,India 8590791959 | abhishekskumar2@gmail.com  https://www.linkedin.com/in/abhishek-s-kumar-213580333? utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=android_app Objective To enhance my professional skills, capabilities and knowledge in an organization which recognizes the value of hard work and trusts me with responsibilities and challenges. Internships KELTRON 19-06-2023 - 25-06-2023 INTERNSHIP Introduction to IoT,Computer Network,Microprocessor,Microcontroller, Introduction to development Board and its types,IoT Devices,Sensors and Actuators,ESP32Development Board:Pinout, Coding Using Arduino IDE TECHMINDZ 23-1-2023 - 27-1-2023 Internship Has closely associated with python programming during the term Education Dhanalakshmi Srinivasan engineering college (autonomous),Anna university 2025 Btech in Artificial intelligence and data science St John's HSS 2021 Higher secondary education 82% Nirmal Jyothi central school 2019 Sslc 85% Skills Sales Team building Problem solving Decision making Adaptability Projects Face Recognition Based Attendance System This project focuses on developing a face recognition-based attendance system designed to automate the process of recording attendance in educational institution ,corporate environments and other settings.The proposed system levarages advanced machine learning algorithm and image processing techniques to ensure high accuracy,reliability,and efficiency in attendance tracking. Braille converting communication device for the hearing and the impaired persons An integrated device that helps hearing and impaired persons for communication. Publications Author :Abhishek s kumar,Muhammad Nazil,Adhil Manu (2025);BRAILLE CONVERTING COMMUNICATION DEVICE FOR HEARING AND IMPAIRED PERSONS An integrated assistive communication device for helping the hearing and impaired persons Key words :Deaf blind assistive system,Arduino based device,Braille display,GSM text to Braille,Sound bite hearing,AI object detection,Voice output,Accessability technology. Languages ENGLISH MALAYALAM TAMIL Personal Details Date of Birth : 05/07/2003 Marital Status : SINGLE Nationality : INDIAN Gender : MALE Place : THRISSUR Certifications Certification of 1million prompters ,An initiative launched by Dubai centre for artificial intelligence Technical Skills Python Java C C++"
  },
  {
    "resume_id": "RES_4",
    "filename": "Ahamed Akhil M N.pdf",
    "raw_text": "Ahamed Akhil MN Skills Data-driven professional with a strong background in full-stack Technical Skills : Python, development and data analytics. Proficient in programming Java, HTML,CSS, JavaScript. languages such as Python, JavaScript, and R. Skilledin Databases: MySQL, developing and deploying web applications and AI MongoDB, SQL. systemsusing frameworks like Django, React, and TensorFlow. DevOps: Git, GitHub Experienced in leveraging big data, performing statistical Non-Technical Skills: Problem analysis, and creating predictive models to optimize business solving, Communication, Time processes and drive revenue growth. Management Languages Contact English (Fluent) Malayalam (Fluent) Place - Palakkad Tamil Phone: +91 8590784048 Hindi Email: ahamedakhil55@gmail.com LinkedIn: linkedIn Certification/Short Courses DevOps Fundamentals - IBM Java Fundamentals - IBM Clean coding-IBM Work Experience Fundamentals of python-IBM Robotics Intern Fundamentals of Digital Marketing-Google SPACE Intro to power visualagents- Developed roboticsproject from conception to completion, Microsoft demonstrating strong project management skills. Implemented innovative solutions for real-world challenges in robotics, PROJECTS showcasing problem-solving abilities. Collaborated effectively with Kodacy team to delivera high-quality Stack Overflow Estimation roboticsproject, highlighting strong teamwork and communication Project (Python): skills. Electrical vehicles Intern Developed a Python-based SPACE tool to detect and estimate Developed roboticsproject from conception to completion, stack overflow risks by demonstrating strong project management skills. analyzing recursive Implemented innovative solutions for real-world challenges in robotics, functions and stack depth. showcasing problem-solving abilities. Applied dynamic Collaborated effectively with Kodacy team to delivera high-quality programming to predict roboticsproject, highlighting strong teamwork and communication stack usage, improving skills. accuracy while reducing computation time and memory usage. Educational Background Optimized performance across multiple codebases Bachelor of Technology in Artificial Intelligence and Machine and validated reliability Learning: through comprehensive testing. Hindusthan Collegeof Engineering and Technology - Coimbatore, Tamil Nadu Documented the tool and Cumulative GPA:7.5/10 - CGPA:7.41/10(up to 6th sem). Relevant Coursework: DSA,DBMS,Data Analytics,Operating system,Data presented insights to Visualization stakeholders, contributing to 2021 - 2025 future development plans."
  },
  {
    "resume_id": "RES_5",
    "filename": "AKSHAY KANNAN.pdf",
    "raw_text": "AKSHAY KANNAN Frontend Developer CONTACT PROFILE SUMMARY Creative and detail-oriented Frontend Developer with a passion for +91 7510191631 building visually stunning, responsive, and user-friendly websites. Skilled in iamakshy81@gmail.com modern technologies like React.js, Tailwind CSS, and JavaScript, I specialize in crafting performance-optimized UIs with clean, maintainable code. Palakkad, Kerala, India Adept at collaborating with teams, integrating APIs, and delivering PORTFOLIO Link seamless user experiences. Always learning, always coding — driven to bring ideas to life through code and design. GITHUB Link EDUCATION PROJECTS 2020 - 2024 ACHIEVERS IT 2025 - PRESENT HICET Mechanical Engineering Built a modern, responsive eCommerce website from scratch using React JS and Redux Toolkit. Integrated product categories, 2025 dynamic product pages, and a functional shopping cart with ACHIEVERS IT add/remove item features. Utilized Tailwind CSS for a glowing UI and implemented async data fetching with createAsyncThunk. Python fullstack current point : 802 SKILLS ACHIEVERS IT 2025 HTML Created a responsive weather application that fetches real-time weather data using the OpenWeatherMap API. Users can search CSS for any city and get current temperature, weather conditions, humidity, and more. BOOTSTRAP Highlights: GIT/GITHUB Integrated REST API using Fetch in JavaScript Displayed dynamic icons and background changes based on JAVASCRIPT weather condition Mobile-first responsive layout REACT JS TAILWIND CSS ACHIEVERS IT 2025 : Built a collection of mini projects to strengthen JavaScript fundamentals and DOM manipulation LANGUAGES skills. Each project focuses on solving a specific UI or logic challenge. Projects Included: English Keyboard Ninja: A typing game where letters fall from the top, and the user must hit the correct key Hindi to score points. Digital Doppelgänger: A fun UI where users generate a cartoon clone by selecting favorite colors, Tamil foods, etc.. Malayalam"
  },
  {
    "resume_id": "RES_6",
    "filename": "ALEX JOBY.pdf",
    "raw_text": "BIO-DATA NAME : ALEX JOBY EDUCATIONAL QUALIFICATIONS : COMPUTER ACCOUNTING (with tally –6 month course) B.Sc PHYSICS (2020) WITH 70% MARKS PLUS TWO (2017) WITH 91%MARKS SSLC (2015) WITH FULL A+ LANGUAGES KNOWN : MALAYALAM, ENGLISH ADDRESS : THOTTIAN HOUSE :KORMALA, KUTTICHIRA P.O, 680724 CONTACT NO : 7902993132, 9400643950 E-MAIL ID : alexjoby85@gmail.com GENDER : MALE MARITAL STATUS : UNMARRIED DOB : 18-04-2000 RELIGION : CHRISTIAN NATIONALITY : INDIAN BLOOD GROUP : B+ve"
  },
  {
    "resume_id": "RES_7",
    "filename": "Aneeta Varghese.pdf",
    "raw_text": "ANEETA VARGHESE FullStackWebDeveloper(ReactandDjango) Email:aneetavarghese987@gmail.com LinkedIn:aneeta-varghese2002 Github:Aneetavarghese20 Mob:+917902882075 EDUCATION Bachelorof Technologyin ComputerScience 2020-2024 LourdesMathaCollegeofscienceandTechnologykuttichal,Trivandrum 6.5/10GPA CARRERSUMMARY FullStackwebdeveloperwithgoodknowledgeintechstackssuchasinHTML,CSS,JavaScript ,Bootstrap,Python,MySQL, React. Js and Django and also completed Full Stack web Development course in python. Experienced in back-end development usingDjango.Proficientinfront-enddevelopmentwithReact.Jsforbuildinginteractiveuserinterfaces. SKILLSSUMMARY  FRONTEND:HTML,JavaScript,CSS,Bootstrap  BACKEND:Python,Django  DATABASE:MySQL  DATABASEMANAGEMENT:PHPMyAdmin  IDE:SublimeText,VSCodes  OtherProgrammingLanguages:Programminginc  OtherSoftware:MSOffice,MSWord  OperatingSystem:Windows,LINUX  Tool&Software:Postman,MySQLWorkbench,PhpMyAdmin  SOFTSKILLS:ActiveListening,ProblemSolving,Responsibilities,DecisionMaking CERTIFICATES  CertifiedinFullstackwebdevelopmentinPythonfromMashup-stack,Trivandrum.(Internship)  Certifiedfor3dayResidentialCampinMachineLearningthroughpython,organizedbyICFOSS. PROJECTS  IMAGEBASEDFOODRECOGNITIONANDALLERGYDETECTION. Food allergy identification and allergy detection.Areal-time food recognition system on Android enables calorie and nutrient assessmentwithoutneedingaserverusingDeepLearningandSVM.  RECIPESHARINGPLATFORM. The Recipe Sharing Platform is a Web application designed to enable users to discover culinary recipes.Users can register,login,and engage with a community focused on cooking by uploading,viewing,and managing recipes using React.js.The platform will also provideanadmininterfaceforcontentmoderationandusermanagementusingDjango.  ACTIVITYPOINTCALCULATOR The Activity Point Calculator isanAndroid applicationdevelopedin Javausing Android Studio, featuring auser interface designed within the IDE. It supports devices running Android 9 and above. The application utilizes a MySQL database for data storage, with PHPscriptsfacilitatingcommunicationbetweentheAndroidfrontendandthebackenddatabase. LANGUAGESKNOWN 1. ENGLISH : Speak,ReadandWrite 2. MALAYALAM:Fluenttospeak,ReadandWrite"
  },
  {
    "resume_id": "RES_8",
    "filename": "ANILA RAJAN.pdf",
    "raw_text": "ANILA RAJAN Email: ra jananila346@gamil.com Akhila bhavan, Chelikkyzhi PO, Mob: 6238541568 Pattazhy, Vadakekara, Kollam Pin Code: 691556 EXPERIENCE Administrative Executive January (2024) – November (2024) SLBS Marklance Info Tech, Cochin  De livered extensive administrative support.  Managed schedules, handled correspondence and prepared documents.  Coordinated meetings and travel arrangements and maintained efficient filing systems and databases.  Communication with clients, vendors and internal departments. Sales Executive City Collections Cosmetics, Cochin January (2023) – January (2024)  Identified and pursued new business opportunities.  Completed sales targets and quotas set by the organization.  Builded and maintained strong relationships with clients. EDUCATION SAP CTS Infotech, CLINTSIIAT INDIA Pvt Ltd., Cochin Bachelor of Commerce in Tax Procedure and Practice Kerala University Plus Two MTDM HSS, Maloor SKILLS  SAP  Data Entry  Communication Skills  Critical thinking  Teamwork  Leadership Quality  Computer skills SERVICE NSS Volunteer CERTIFICATE National Council for Technology and training REFERENCE Sumaya Shaji – IHRD College, Kalanjoor Contact - 9544435540"
  },
  {
    "resume_id": "RES_9",
    "filename": "ANJALI K C.pdf",
    "raw_text": "ANJALI K C DOB : 10| 03| 2005 SUMMARY CONTACT Seeking an opportunity to utilize my skills and qualifications in a collaborative environment, making a meaningful impact and advancing 8590927254 my professional journey. EDUCATION anjalikc620@gmail.com Kudilil Puthen Purayil H Mahatma Gandhi University Karimannoor P.O, College of Applied Science, Muttom, Thodupuzha, Kerala Kurumbalamattom B.Sc Computer Science Thodupuzha, Idukki Year Of Passing : 2025 SKILLS State Board Higher Secondary G.T.H.S.S Peringassery, Thodupuzha, Kerala Communication Science Year Of Passing : 2022 Team Work Decision Making State Board High School Self Discipline ST. Joseph’s H.S.S Karimannoor, Kerala Year Of Passing : 2020 LANGUAGE COMPUTER SKILLS English HTML C Malayalam PHP C++ REFERENCE Python Ms. Jisha Subhash (Asst. Prof in Computer DECLARATION Science, CAS Muttom) contact: +91 9074601405 I, Anjali K C, hereby declare that the information contained herein is true and correct to the best of my knowledge and belief"
  },
  {
    "resume_id": "RES_10",
    "filename": "Anjana NP.pdf",
    "raw_text": "A N J A N A N P 8590928361 P R O F I L E Energetic and adaptable postgraduate fresher with strong communication skills, a anjananediyaparampath@gmail.com solid foundation in technology, and a passion for creative problem-solving. Curious and quick to learn, I thrive in collaborative settings, enjoy tackling Manjeri, Malappuram challenges, and adapt easily to dynamic environments. With a dual academic background in Computer Applications (MCA) and English Literature (MA), I bring a unique blend of logical thinking, technical awareness, and clear communication. I’m open to exploring opportunities in IT, media, communication, business, and research where I can contribute meaningfully, gain hands-on experience, and grow alongside the team. S K I L L S E D U C A T I O N Communication & Team Collaboration Master of Computer Application (MCA) 2023– 2025 Problem Solving & Logical Reasoning CGPA - 8.16 Adaptability & Quick Learning Calicut University – Centre for Computer Science & Technology, Manjeri Basic Project Coordination Documentation & Organizational Skills Master of Arts in English Language and Literature Client Interaction & Support 2023 – Present (Pursuing) Digital & Computer Literacy Sree Narayana Guru Open University L A N G U A G E S Bachelor of Arts in English Language and Literature 2019 – 2022 CGPA - 7.783 Malayalam Noble Women’s College, Manjeri English Hindi Diploma In Computer Application (DCA) 2022 Tamil (Speak only) 96.4% Scole Kerala E X P E R I E N C E A C A D E M I C P R O J E C T Abacus Trainer DreamWorld – AI-Based Dream Interpretation Web App Golden Abacus Tech Stack: React, TypeScript, Supabase, Flask, Google Cloud AI Volunteer – Poorna Cultural Festival (2nd Edition) A journaling platform to record dreams, analyze emotions using AI, and visualize dream elements. Poorna Publications, Kozhikode Built frontend using React and TypeScript Integrated Supabase backend with Google AI for NLP A C H I E V M E N T S Focused on user experience and emotional insight UUC 2023 - 2025 YIP 4.0 Distict Winner Kerala State School Kalolsavam Winner Calicut university Insight Best Performer 2024 Kerala Rank (20th)–Viksit Bharat Essay Contest 2024"
  },
  {
    "resume_id": "RES_11",
    "filename": "ANUMOL REJI.pdf",
    "raw_text": "A N U M O L R E J I FRESHER CONTACT EDUCATION Perusseril h murukkady po Post Graduate kumily Idukki ,685535 Master of science in Computer Science 9544732029 anureji6282@gmail.com Under Graduate Bachelor of science in Mathematics SKILLS EXPERIENCE Good Communication Skill June 2023 to January 2024 Leadership Quality Senior Excecutive in Xylem Private Limited Active listening Public speaking Presentation skills Multi-Tasking LANGUAGE KNOWN Engish ,Hindi ,Malayalam ,Tamil"
  },
  {
    "resume_id": "RES_12",
    "filename": "APARNA DAS.pdf",
    "raw_text": "APARNA DAS DevOps and AWS Basics|prompt Engineering|Generative AI|Troubleshooting Skills aparnadass2002@gmail.com * Linkedin * +91 9633100599 * Palakkad, Kerala, India PROFESSIONAL SUMMARY Motivated IT postgraduate with an MCA and a B.Sc. in Computer Science. Familiar with AWS-based DevOps, Generative AI, and Prompt Engineering. Skilled in Python, SQL, database concepts, and system troubleshooting. Quick learner with a strong interest in cloud computing, automation, and AI technologies. Eager to contribute, grow with industry experts, and support organizational goals through sincere and quality-driven work. TECHNICAL SKILLS Cloud & DevOps Fundamentals : AWS (EC2, S3, IAM – basics), CI/CD Concepts, Docker (fundamentals), Git & GitHub Programming Languages : Python (basic), Java, C, C++, HTML, CSS Prompt Engineering & Generative AI : Prompt crafting for ChatGPT/LLMs, understanding of Generative AI use cases and workflows Database Technologies : MySQL, MongoDB, ER Diagrams, Normalization Tools & Operating Systems : Linux (basic commands), VS Code, Pycharm, ChatGPT,Gemini,midjourney,OpenAI playground , Troubleshooting Enterprise Tools : CRM, CRT, SAP BRIM Soft Skills : Problem Solving, Critical Thinking, Leadership, Teamwork, Communication EXPERIENCE TECHNICAL SUPPOR T ENGINEER - Aabasoft,Kochi,Kerala EDUCATION Master Of Computer Application (MCA) 08/2023 - 05/2025 APJ Abdu l Kalam Technological University (KTU) Pambady Bsc Computer Science 08/2019 - 05/2022 University Of Calicut (CU) Vadakkenchery PROJECTS Tillage Observation Process : An IoT-based agriculture monitoring system Developed an IoT-based agriculture monitoring system integrated with Telegram for real-time alerts on soil moisture, temperature, humidity, and nutrient levels, enabling instant mobile updates for farmers. Auth Guard System for Election : A Web application to digitize campus elections Proposed and developed a web application to digitize campus elections, replacing the manual process to address inefficiencies, delays, and limited accessibility. The system automates voter registration, vote counting, and result compilation, enhancing accuracy, transparency, and voter participation while saving time and reducing human error. IT Employee Management System : A web-based system to manage IT projects and employee tasks Developed a web-based system to manage IT projects and employee tasks efficiently. The system includes three user roles— Admin, Team Lead, and Developer—for assigning tasks, tracking progress, and managing roles. Key features include task notifications, daily updates, file attachments, secure login, and mobile responsiveness. Improved communication, transparency, and productivity within IT teams. CERTIFICATES Completed NPTEL Online Certification in Introduction to Internet of Things Internship in Internet of Things Artificial intelligence internship Participated in Cyber Security Workshop Prompt Engineering with ChatGPT Introduction to Generative AI Studio Fundamentals of DevOps on AWS Generative AI for Beginners PUBLICATIONS Agriculture Monitoring System : LINK International Journal for Research in Applied Science & Engineering Technology (IJRASET)"
  },
  {
    "resume_id": "RES_13",
    "filename": "Aswathy V.pdf",
    "raw_text": "Aswathy V Palakkad,Kerala–678102 6235729231| aswathyanuece@gmail.com GitHub:github.com/NextOne3292|GitLab:gitlab.com/users/aswathyanuece/projects LinkedIn:https://www.linkedin.com/in/aswathy-vinayan-88aa48317 Summary PassionateandcommittedFullStackWebDevelopertrainedintheMERNstack(MongoDB,Express.js, React.js,Node.js). Strongincreatingresponsive,user-centricwebapplications,RESTfulAPIs,andfull-stacksolutions. Lookingforaninternshipopportunitytoapplymylearningandgrowinareal-worlddevelopmentteam. Education B.TechinElectronicsandCommunicationEngineering–NorthEastFrontierTechnicalUniversity, ArunachalPradesh YearofPassing:Present(Ongoing) Certifications FullStackWebDevelopment–EntriApp,2025 Fullstackwebdevelopment –Illinoisinstituteoftechnology(2025) Technical Skills Frontend:React.js,HTML,CSS,JavaScript,TailwindCSS,Bootstrap Backend:Node.js,Express.js,RESTfulAPIs Database:MongoDB,Mongoose Authentication:JWT,bcrypt Tools:Git,GitHub,GitLab,Vercel,Render Projects FoodOrderingWebApp -TechStack:React,Node.js,Express,MongoDB -Builtaresponsivefoodorderingplatformwithauthenticationandcart/ordermanagement. -Admindashboardtomanagerestaurants,menuitems,andorders. -JWTauth+cookie-basedsessionhandling. LiveDemo:https://food-order-web-app-frontend2.vercel.app LookingFor AfullstackinternshiprolewhereIcan: -Contributetoreal-worldwebapplications -Learnfromseniordevelopers -Improvemybackend/frontenddevelopmentskills"
  },
  {
    "resume_id": "RES_14",
    "filename": "Avinash Fernandez.pdf",
    "raw_text": "A V I N A S H F E R N A N D E Z A skilled culinary professional with more than 5 years of experience in food preparation and kitchen management. Currently working as Chef De Partie at NASHE’S with previous stints at Le Petit Four, Pondicherry, and Hotel Sidhartha, Thrissur. Experienced in Continental and South Asian cooking with a keen focus on maintaining quality, efficiency, and food safety standards. Gained international exposure through an internship at Louisville Marriott Downtown, Kentucky. Passionate about delivering an exceptional culinary experience and fostering team growth. +91 9961310123 af14son@gmail.com 04-01-1999 Jasmin Dale (H.No.154), Bye Lane 5, Old Desom Road, Thottakkattukara, Aluva, Ernakulam, Kerala, India - 683108 WORK HISTORY EDUCATION NASHE’S, ALUVA, INDIA ( 08/2024 - PRESENT) Master of Business Administration in Fintech CHEF DE PARTIE (CDP) (Currently Pursuing) Oversees food preparation; ensuring quality and timely service. Amrita Vishwa Vidyapeetham, Amritapuri, Contributes to menu development with creative and cost-effective ideas. Kerala, India Ensures adherence to hygiene and food safety standards. B.Sc in Hospitality and Hotel Administration Trains and supervises junior staff to ensure efficiency and consistency. (2016 - 2019) Manages inventory and minimize wastage through effective resource use. Institute of Hotel Management, Bangalore, Resolves operational challenges to maintain smooth kitchen operations. India LE PETIT FOUR, PONDICHERRY, INDIA ( 03/2023-06/2023) Higher Secondary (2014 -2016) COOK Rajashree SMM School, Kerala, India Prepared dishes as per menu and quality standards. Secondary (2014) Maintained kitchen cleanliness and adhered to hygiene protocols. Rajashree SMM School, Kerala, India Assisted in inventory management and ensured ingredient availability. Supported the team during peak hours, ensuring seamless operations. CERTIFICATE COURSE Gained experience in Continental cuisine preparation. STCW 2010 (BST + PSA), Albert's Maritime HOTEL SIDHARTHA, THRISSUR, INDIA (09/2019–02/2023) Institute, Kerala, India – June 2022 COMMIS - 1 Prepared dishes per menu standards, ensuring quality and consistency. Crisis Management, Cochin Maritime Assisted senior chefs with food preparation, plating, and daily kitchen Academy, Kerala, India – June 2022 operations. Crowd Management, Euro Tech Maritime Maintained hygiene and safety standards across all kitchen activities. Academy, Kerala, India – July 2022 Monitored inventory, minimized wastage, and ensured efficient resource management. MY SKILLS Gained experience in South Asian cooking mainly Indian and Indo Chinese. Culinary Experience (Continental and South Asian Cuisine) Food Safety and Hygiene Management INTERNSHIP Menu Planning and Development Inventory and Stock Control Louisville Marriott Downtown, Kentucky, USA (14/09/2023 – 15/11/ 2023) Time Management and Multitasking Cultural Exchange Programme Staff Training and Development Gained experience in hospitality and culinary operations within a Quality Control and Presentation multicultural environment. Customer Service and Satisfaction Enhanced skills in maintaining international service and quality standards. Problem-Solving and Critical Thinking Holiday Inn, Cochin, India (27/06/2017 – 20/10/2017) Mandatory Internship during 3rd Semester of college education LANGUAGE Gained practical experience in hotel operations as part of college curriculum. English | Malayalam | Hindi Assisted in daily tasks across multiple hotel departments. ACHIEVEMENTS FREELANCE WORKS State Judo Champion (100 kg+), 2016 - Kerala, India Participated in large- and small-scale banquets. Bartended at high-profile concerts, including performances by DJ Snake and District Judo Champion (100 kg+), 2015 - Nucleya. Ernakulam, Kerala, India Volunteered in the kitchen of JW Marriott Hotel, Bengaluru, India and Brown Belt (Ikkyu), certified by Kerala Judo various community kitchens. Association. Captain of soup team in team lunch during college events."
  },
  {
    "resume_id": "RES_15",
    "filename": "Aysha P Faizel.pdf",
    "raw_text": "Aysha P Faizel Senior Software Engineer aysha.faisal10@gmail.com 9544098384 Ernakulam, India WORK EXPERIENCE SKILLS API Developer Java Spring Boot Postgresql Nodejs AWS Air India Limited Javascript RestApi MySQL React 08/2024 - Present, Achievements/Tasks Developed scalable and secure RESTful APIs using Node.js and Express.js, facilitating seamless interaction between client-side PROJECTS WORKED applications and server-side resources. Implemented data persistence solutions using MongoDB, ANA-CAS (06/2021 - 05/2023) including designing schema, creating indexes, and optimizing Proficient in designing and implementing RESTful APIs to facilitate queries to enhance performance and reliability. seamless communication between web applications. Contributed to the development of high-performance applications using JavaScript (Node.js), optimizing data processing and enhancing Java Developer overall application efficiency. Inspired Entertainment, Inc. Collaborated in code reviews and provided valuable insights to enhance code quality. 05/2024 - 07/2024, Assumed responsibility for understanding project scope and Achievements/Tasks gathering requirements, translating them into functional Create and manage Docker images for Javascript applications, documentation for project clarity. ensuring consistency across different environments. Understanding the business and working with clients for the functional testing of developed business functions using Rapid test Developed and maintained responsive user interfaces for web framework(Automated testing). applications using React.js, ensuring cross-browser Worked closely with the testing team to identify, prioritize, and compatibility and optimal performance resolve bugs and issues in a collaborative manner, ensuring the delivery of high-quality, bug-free software to end-users. Senior Software Engineer HIS (06/2023 - 04/2024) IBS Software Solutions Worked closely with the testing team to identify, prioritize, and 06/2021 - 04/2024, Cochin,India resolve bugs and issues in a collaborative manner, ensuring the delivery of high-quality, bug-free software to end-users. Achievements/Tasks Successfully contributed to developing and implementing new Demonstrated strong expertise in backend development using features within Java Spring Boot applications, enhancing their Core Java, including object-oriented programmingr (OOP) functionality and user experience. concepts, Collections framework, and Exception Handling. Contributed in developing and implementing new API from scratch aligning them with the business requirements. Proficient in MyBatis framework and MongoDb for Database operations. Demonstrated a strong commitment to code quality by optimizing and enhancing existing codebase to accommodate new feature Managed CI/CD pipeline using CircleCI and Git for automating requirements efficiently. build and deployment process. Utilized agile development methodologies to prioritize and plan feature implementation Designed and implemented robust backend solutions using JavaScript (Node.js), ensuring efficient data processing and seamless integration with frontend applications. FullStack Trainer Nestsoft Technologies 03/2023 - 04/2024, Achievements/Tasks Provided one-on-one training sessions to students in Java,Node.js and React ensuring personalized guidance and support to enhance their understanding and skills. Assisted students in developing their projects, ensuring they applied their knowledge effectively and gained hands-on experience. I helped students grasp concepts clearly by explaining them in an easy-to-understand manner."
  },
  {
    "resume_id": "RES_17",
    "filename": "Cyril M George.pdf",
    "raw_text": "Cyril M George Pathanamthitta, Kerala, India cyrilmgeorge07@gmail.com — +91 94002 31940 linkedin.com/in/cyril-m-george-9240ab354 — github.com/cyrilmgeorge Professional Summary Motivated Computer Science graduate with a strong foundation in programming, databases, and web technologies. Experienced in academic and certified projects involving data handling, application devel- opment, and analysis. Quick learner with good problem-solving skills, adaptability, and the ability to work effectively both independently and in teams. Seeking opportunities to contribute, learn, and grow across diverse technology-driven roles. Education BSc Computer Science 2022 – 2025 Mahatma Gandhi University, Kottayam Relevant Coursework: Programming, Database Systems, Web Development, Statistics Higher Secondary Education 2020 – 2022 Board of Higher Secondary Education, Kerala Core Skills Programming & Scripting: Python, JavaScript, SQL Web Technologies: HTML, CSS, Bootstrap, PHP Frameworks: Django, Flask (basic) Databases: MySQL, PostgreSQL Data Handling: Data Cleaning, SQL Queries, Basic Data Analysis Visualization & Reporting: Power BI Dashboards, Documentation Tools & Platforms: Git, GitHub, VS Code Productivity Tools: MS Excel (basic formulas, formatting) Soft Skills: Communication, Teamwork, Time Management, Problem Solving Academic & Practical Projects Sales Data Analysis and Reporting 2025 • Worked with structured datasets to extract insights using SQL queries. • Designed interactive dashboards and reports using Power BI. • Focused on data accuracy, clear visualization, and meaningful interpretation. College Library Management System 2025 • Developed a web-based system to manage records, users, and transactions. • Implemented database operations using PHP and MySQL. • Applied validation techniques and handled common system errors. E-Learning Application 2025 • Built a basic learning platform for managing course content and assessments. • Used Python for structured file handling and data management. • Tested features to improve usability and data consistency. Task Management Web Application 2024 • Created a CRUD-based web application for managing daily tasks. • Used Django framework and database models for backend logic. 1 • Gained hands-on experience in debugging and application testing. Certifications E-Learning Application Development – Youngtech IT Solutions (2025) College Library System Project – Youngtech IT Solutions (2025) Python Flask Framework – Youngtech IT Solutions (2025) Web Designing – Gtech Computer Education Center (2022) Languages English — Professional Proficiency Malayalam — Native 2"
  },
  {
    "resume_id": "RES_18",
    "filename": "DEVIKA B.pdf",
    "raw_text": "DEVIKA B devikab140@gmail.com • +91 9946596824 • LinkedIn • GitHub Summary Detail-oriented and proactive Data Science graduate with strong foundational skills in mathematics, statistics, and Python programming. Experienced in collating, cleansing, analyzing, and visualizing large datasets. Possess excellent communication skills, a keen eye for detail, and a strong willingness to learn and grow within a dynamic team. Eager to contribute to market research, data quality, and process improvement through accurate and efficient data handling. Education Vellore Institute of technology, Chennai 2023 - 2025 Master of science in Data Science | GPA : 8.68 Kannur University, Kerala 2020-2023 Bachelor of science in Mathematics | CGPA : 9.094 Directorate of Higher Secondary Education, Kerala 2018-2020 Biology Science Projects Driver Drowsiness Detection System Tools: Python, Keras, OpenCV Built a fatigue detection system using facial feature tracking and image classification.  Inception V3 outperformed standard CNNs in accuracy and generalization.  Phishing Detection Using Deep Learning Tools: BERT, GRU, LSTM-CNN Compared NLP models for email/text phishing detection.  LSTM-CNN model achieved the highest accuracy in classifying malicious content.  Enhanced Brain Tumor Segmentation Tools: CoAtNet, MRI/PET/CT fusion Developed a segmentation model using multi-modal imaging.  Fused images significantly improved diagnostic precision over single-modality inputs.  Skills Data Processing: Data collation, cleaning, validation, and transformation  Technical Tools: Python, SQL, Excel, Power BI, R, OpenCV  Statistical Methods: Regression, classification, multivariate analysis  Productivity Tools: MS Excel (functions, pivot tables, charts), MS Word  Communication: Strong written and verbal communication in English  Soft Skills: Time management, attention to detail, quick learning, teamwork, flexibility in  shift timings Certifications 1. Oracle Database Design and Database Programming with SQL 2. VAC2317- Interactive Data Visualization (Power BI, Tableau) 3. Supervised Machine Learning: Regression and Classification Languages Known: English, Tamil, Malayalam (Native)"
  },
  {
    "resume_id": "RES_19",
    "filename": "Dilja Das ER.pdf",
    "raw_text": "Dilja Das ER 7025052001 | diljadaser@gmail.com | LinkedIn: https://www.linkedin.com/in/dilja-das-e-r-804004218 PROFESSIONAL SUMMARY Full Stack Developer with hands-on experience in building responsive, user-friendly, and scalable web applications using React.js, Node.js, Express.js, and MySQL/MongoDB. Proficient in integrating RESTful APIs, optimizing database performance, and following Agile methodologies. Strong debugging skills and a passion for delivering high-quality code. TECHNICAL SKILLS Front-End: HTML5, CSS3, JavaScript, Bootstrap, React.js Back-End: Node.js, Express.js, REST APIs Databases: MySQL, MongoDB Tools & Platforms: Git, Chrome Developer Tools, Postman API Methodologies: Agile PROFESSIONAL EXPERIENCE Software Developer Future Tech Labs – Ernakulam, Kerala | Dec 2024 – Apr 2025 • Developed responsive front-end interfaces using Bootstrap and JavaScript. • Integrated RESTful APIs to enhance application functionality. • Debugged and troubleshooted applications using Chrome Developer Tools. Software Developer Intern Bairuha Tech – Kozhikode, Kerala | Feb 2024 – May 2024 • Assisted in full-stack development of web applications using React.js and Node.js. • Collaborated in Agile workflows, including sprint planning and code reviews. PROJECTS E-Learning Platform • Developed a full-stack platform using React.js, Node.js, and MySQL. • Implemented secure user authentication and course enrollment features. Coffee App • Built a full-stack e-commerce platform using React.js, Node.js, and MySQL. • Enabled product listing, search, and purchase of coffee products. • Implemented admin dashboard for managing users, products, and orders. EDUCATION Master of Computer Application (MCA) University of Calicut – CCSIT Pudukkad, Thrissur (2022 – 2024) Bachelor of Computer Science University of Calicut – Prajyoti Niketan College, Pudukkad (2019 – 2022) CERTIFICATIONS • MERN Stack Development (3 Months)"
  },
  {
    "resume_id": "RES_20",
    "filename": "Doppalapudi Nithin.pdf",
    "raw_text": "Doppalapudi Nithin Chowdarynithin2183@gmail.com | +91 7569594779 | linkedin Professional Summary Results-driven Full Stack Developer with hands-on experience in MERN stack development and a proven track record of delivering responsive web applications. Demonstrated expertise in reducing load times by 40% and implementing SEO strategies that increased organic traffic by 15%. Seeking a challenging role to leverage technical skills in building scalable solutions. Technical Skills Programming Languages: JavaScript (ES6+), Python, HTML5, CSS3 Frontend Development: Bootstrap, Responsive Design Backend Development: Node.js, Express.js, RESTful APIs, Authentication & Authorization Database Management: MongoDB, MySQL Development Tools: Git, GitHub, VS Code, Chrome DevTools Additional Skills: Web Security, Performance Optimization Professional Experience Full Stack Developer Intern Dec 2024 – Mar 2025 Quantam wave it Solutions , Vijayawada, Andhra Pradesh • Engineered a high-performance e-commerce platform using MERN stack, resulting in 40% faster page load times • Implemented RESTful APIs with Node.js and Express.js, achieving 20% reduction in API response time • Developed and optimized database queries, improving data retrieval efficiency by 25% • Integrated automated testing procedures, reducing bug detection time by 30% • Collaborated in an Agile environment with daily standups and sprint planning Projects Study-Planner Live Link November 2024 • Built a task management system with priority settings, deadlines, and status tracking. • Developed a responsive dashboard for organizing and accessing notes seamlessly. • Implemented secure authentication and smooth error handling for enhanced user experience. • Utilized HTML, CSS, JavaScript, Python, Flask, and SQLite for full-stack development. SoJourn Live Link August 2024 • Integrated user authentication using Passport.js for secure login and registration. • Enabled users to create, edit, and delete property listings with an intuitive UI. • Implemented functionality for adding and managing user reviews for listings. • Stored persistent sessions in MongoDB for seamless user experience. • Developed using HTML, CSS, JavaScript, Node.js, Express.js, and MongoDB. Education Bachelor of Technology in Computer Science and Engineering (Parul university) CGPA: 6.3 , Parul University, Vadodara, Gujarat 2025 • Gained expertise in algorithms, data structures, and full-stack web development. • Developed and deployed a full-stack web application, demonstrating proficiency in JavaScript, HTML, CSS, and Python Flask. MERN Stack Development - Apna College: Completed intensive training in MongoDB, Express.js, React.js, and Node.js, and built multiple full-stack applications using industry-standard practices."
  },
  {
    "resume_id": "RES_21",
    "filename": "DURGALEKSHMI.pdf",
    "raw_text": "DURGALEKSHMI ADDRESS: EMAIL: PHONE: VEROORKIZHAKETHIL, KUTTEMPEROOR durgalekshmi91@gmail.com 9188364145 P O MANNAR Objective  To secure a challenging and rewarding role in computer application where i can utilize my skill and abilities to make a positive impact and achieve personal and professional growth. EDUCATION  (2023 - 2025) – MASTER OF COMPUTER APPLICATION MACFAST, TIRUVALLA , MG UNIVERSITY  (2019 - 2022) – B.COM COMPUTER APPLICATION CHRISTIAN COLLEGE , CHENGANNUR , KERELA UNIVERSITY  (2017 - 2019) – HIGHER SECONDARY NSBHSS, MANNAR  (2017) - SSLC , SKVHS, KUTTEMPEROOR , MANNAR ACADEMIC PROJECT  MAJOR PROJECT : COLLEGE BUS PASS MANAGEMENT SYSTEM College Bus Pass Management System – Developed a web-based application using Django, HTML, CSS, and JavaScript to digitize student bus pass registration, renewal, payment, and admin management of routes, fees, and notifications, improving efficiency and reducing manual work.  IV PROJECT : CLINIC MANAGEMENT PROJECT Clinic Management System – Built a web application using Angular 14, Django, and MySQL to manage patient records, appointments, billing, and doctor schedules, enhancing efficiency and reducing manual processes.  DEGREE PROJECT: A study on customer attitude towards special schemes provided by post office bank with special reference to Chengannur Municipality. CERTIFICATIONS  Web development using MERN STACK Capital InfoTech , Thiruvalla  IV project certificate – Faith InfoTech Techno park , Trivandrum  DBMS , python for data science - Nptel Swayam TECHNICAL SKILLS Language/database : C – programming , python, php , javascript DBMS, MongoDB, SQLite, HTML, CSS, Oops Concept. SOFT SKILL  Charistmatic and confident public speaker  Teamwork  Effective Communication  Time Management  Proficient with MS WORD , EXCEL , and POWERPOINT ROLES HANDLED  Program coordinator , cultural head , Macfestia 2k23 - MCA DEPT , MACFAST  SPC CADET (2014 - 2017) LANGUAGES  English , Malayalam , Tamil Conversional speaking only REFERENCE Ms. Vidhya v kumar Asst. prof, MACFAST , Tiruvalla , Pathanamthitta Vidhya.sujith@macfast.org + 91 9496330882 2"
  },
  {
    "resume_id": "RES_22",
    "filename": "GAYATHRI P K.pdf",
    "raw_text": "GAYATHRI P K THIRUVANANTHAPURAM 8891528133 | gayathripk129@gmail.com | https://www.linkedin.com/in/gayathri-pk-20b614221 OBJECTIVE Computer Science graduate, pursuing a Master’s in Machine Intelligence. Skilled in Python, HTML, CSS, and AI/ML. Eager to leverage my technical expertise and analytical skills to contribute to organizational success while advancing my knowledge in emerging technologies. TECHNICAL SKILLS Programming Languages: Web Development: Django, HTML, Databases: MySQL, PostgreSQL Python, C CSS Data Analysis & Visualization: Pandas, Numpy, Matplotlib, Tableau PROJECTS E-Vaccine Finished a project using Django/Python which is the base for a website that would be helpful for people for finding vaccines available near them it would also help them in consulting an experienced doctor before registering for a vaccine. EDUCATION Kerala university of Digital Sciences,Innovation and Technology 2026 M.Sc. Computer Science in Machine Intelligence AWH SPECIAL COLLEGE (Calicut University) 2024 B.Sc. Computer Science CGPA : 6.75 CERTIFICATIONS Ethical hacking and Bug Bounty hunting - Udemy (2022) HTML5 and CSS3 (Beginner to expert)- Udemy (2021) SOFT SKILLS Problem Solving | Analytical Thinking Communication | Team Collaboration Time Management | Attention to details"
  },
  {
    "resume_id": "RES_23",
    "filename": "HARIPRIYA SAJEEVAN.pdf",
    "raw_text": "HARIPRIYA SAJEEVAN Digital Marketing Executive haripriyacsdigital@gmail.com 9188607092 Vaikom kottayam, kerala ABOUT ME Highly motivated and creative Digital marketing graduate with a strong foundation in social media marketing, SEO, Meta Ads, Google ads, content creation and analytics. Skilled in developing online campaigns and utilize digital tools for brand growth. Dedicated to using strategic analysis and creativity to build impactful digital marketing campaigns. INTERNSHIP Digital marketing Internship, SDC networks 07/2025 Managed and scheduled content across Instagram, Facebook, and LinkedIn. kaloor, kochi • Created and optimized Google Ads campaigns. • Conducted keyword research and implemented basic SEO strategies. • Tracked engagement metrics and created performance reports using Google • Analytics. Collaborated with the design team to create social media visuals using Canva. • EDUCATION Bachelor Of Computer science, MG University 2022 – 2025 Professional diploma in Digital marketing, SDC networks 2025 SKILLS Digital Marketing Content Marketing SEO Google analytics Email marketing Social media management Google ads Meta ads LANGUAGE English Malayalam"
  },
  {
    "resume_id": "RES_24",
    "filename": "HARISANKAR K  S.pdf",
    "raw_text": "H A R I S A N K A R K . S 9037452924 hari.kavunkal.ks@gmail.com kavunkal(H)Inchiyani PO Vattakkavu,686512,Kottayam, PROFESSIONAL SUMMARY Enthusiastic andd edicated Bach elor of Computer Applications(BCA) graduate with a soild foundation in software development, programming and database systems. Proficient in Java, SQL, HTML, CSS, and modern frameworks, with practical experience gained through academic and personal projects.Demonstrates strong analytical thinking, effective collaboration and a passion for continuous learning. TECHNICAL SKILLS Programming Languages: Java, C, C++, PHP, HTML, CSS Database: MYSQL Operating Systems: Linux Tools & Technologies: NetBeans Soft Skills: Critical Thinking, Adaptability, Time Management, Communication EDUCATION BACHELOR OFCOMPUTERA PPLICATION (BCA) 2022-2025 Sree Sabareesa College, Murikumvayal PLUS T WO 2020-2022 CKM HSS, Koruthode SSLC 2019-2020 Holy Family High School , Inchiyani PROJECTS Online Pet Shop Management System Technologies: PHP, HTML, CSS, JavaScript, MYSQL Managed product listing, order placement, and user authentication College placement cell website Technologies: Java, HTML, CSS, JavaScript,MYSQL Created a web-based platform for managing campus placements INTERNSHIP EXPERIENCE javaI ntern - RISSTechnologies Jan-March LANGUAGES English Malayalam REFERENCE Akhil jith B Head of the department, Sree Sabareesa College, Murikumvayal 9526232429 DECLARATION I here by declared that the information provided is truth to the best of my knowledge"
  },
  {
    "resume_id": "RES_25",
    "filename": "JAHANARA JABBAR.pdf",
    "raw_text": "JAHANARA JABBAR +91 6235766891 jjahanara471@gmail.com https://www.linkedin.com/in/jahanara-jabbar-10963b284/ Thrissur, Kerala AI/ML DEVELOPER | PYTHON DEVELOPER Motivated and enthusiastic AI/ML developer with a solid understanding of machine learning algorithms and deep learning frameworks, experienced in developing and deploying scalable solutions tailored to business needs. Proficient in data preprocessing, model training, and evaluation using tools like TensorFlow, PyTorch, and scikit-learn. Passionate about exploring new techniques and staying updated with the latest advancements in artificial intelligence. Additionally, knowledgeable in Python development with a strong foundation in programming fundamentals, eager to contribute to innovative software solutions. Quick learner with excellent problem-solving skills, committed to continuous learning, and proficient in Python frameworks such as SciPy, NumPy, and Matplotlib. KEY COMPETENCIES Problem solving Interpersonal skills Adaptability Critical thinking skills Leadership Persistence Quick learning Time management Ethical mindset PROFESSIONAL EXPERIENCE AI Developer Internship June 2023 - Nov 2023 Soften Technologies Developed ML algorithms to analyze huge volumes of historical data to make predictions. Designed machine learning systems and self-running artificial intelligence (AI) software to auto. Selected appropriate datasets and data representation methods.Eager to apply academic knowledge and gain practical experience in the field of artificial intelligence. Proficient in data preprocessing, model training, and evaluation, with hands-on experience in Python and frameworks likeTensorFlow and scikit-learn. A quick learner with a passion for solving complex problems and a commitment to continuous learning. Excited to collaborate with experienced professionals, contribute to impactful projects, and further develop skills in AI/ML technologies. EDUCATION ARTIFICAL INTELLIGENCE & DATA SCIENCE 2022 - 2023 SOFTEN TECHNOLOGIES (SOFTWARE TRAINING INSTITUTE) | Kochi, Kerala Bachelor Of Computer Science 2019 - 2023 University Of Calicut , Calicut, Kerala A.C. Kunhimon Haji Memorial ICACollege,Thozhiyoor,Thrissur,Kerala PROJECTS ACADEMIC PROJECT AGRICULTURAL INFORMATION AND COMMERCE PLATFORM Enabled online purchases of agricultural essentials like seedlings, fertilizers, and seeds directly through Krishi Bhavan or Agroservice Centers Supported online payments and cash-on-delivery options, providing convenience for product purchases. Farmers can sell their organic produce through the platform, ensuring fair profits and allowing other users to purchase these products MINI PROJECT SPEECH SENTIMENTAL ANALYZER Utilized the SpeechRecognition library to capture audio input from the microphone. Employed the VADER lexicon from NLTK to gauge sentiment intensity and categorize it as positive, negative, or neutral. Provided real-time sentiment analysis, allowing instant interpretation of spoken sentiment MAIN PROJECT HAND GESTURE RECOGNITION AND VOICE COMMAND CONTROL PROJECT Employed the Mediapipe library to detect and track hand landmarks in webcam frames. . Trained a deep learning model using TensorFlow/Keras to classify gestures from hand landmarks Integrated speech recognition to enable voice-activated control alongside gesture recognition TECHNICAL SKILLS Python Computer Vision Numpy Tensorflow SciPy Data Science Matplotlib Data Analyst NLP Artificial Intelligence HTML Machine Learning SQL Deep Learning LANGUAGE SKILLS English Malayalam Arabic Hindi"
  },
  {
    "resume_id": "RES_26",
    "filename": "jayakrishnan k.pdf",
    "raw_text": "JAYAKRISHNAN K AI & ML Engineer +91-8606811330 jayakrishnank664@gmail.com LinkedIn Kannur, Kerala, India PROFILE SUMMARY AI and ML engineer with expertise in machine learning, deep learning, and computer vision. Experienced in developing AI-driven security, recommendation, and predictive maintenance systems. Strong problem- solving, analytical, and leadership skills. EDUCATION B.E in Artificial Intelligence and Machine Learning 2021 - 2025 Yenepoya Institute of Technology, CGPA: 7.5 PROFESSIONAL EXPERIENCE Techbyheart India Pvt Ltd, Kochi, India – AI & Python Intern Jan 2025 – May 2025 • Completed an internship focused on Artificial Intelligence, Machine Learning, and Python. • Demonstrated strong inquisitiveness and dedication by deeply exploring core division functionalities. • Applied efforts to understand advanced AI/ML concepts and improve practical skills. Torc Infotech, Kochi, India – Web Development Intern Oct 2023 - Nov 2023 • Developed AI-powered e-commerce and news platforms with personalized recommendations. • Built an automated sentiment analysis model to classify news articles. Genesis, Mangalore, India – Android App Development Intern Oct 2022 - Nov 2022 • Designed and developed two mobile apps using Java/Kotlin and Firebase. • Optimized app performance, reducing load time by 30%. PROJECTS Car Rental Management System Apr 2024 - Aug 2024 • Developed a DBMS for rental operations, vehicle tracking, and reservations. • Implemented a dynamic pricing algorithm to optimize revenue. AGRI-TECH: AI-Based Machinery Maintenance System Jan 2024 - May 2024 • Designed an AI-powered predictive maintenance system using reinforcement learning. • Integrated IoT sensors for real-time data monitoring and failure prediction. AlertSense: AI-Based Intruder Detection System Nov 2024 - Jan 2025 • Implemented an AI-driven security system with real-time image processing. • Reduced false alarms by 40% using advanced filtering techniques. TECHNICAL SKILLS • Programming: Python, HTML, SQL • Python Libraries: NumPy, Pandas, Matplotlib, Beautiful Soup, SciPy • Machine Learning & AI: Deep Learning, OpenCV, Scikit-learn, TensorFlow, PyTorch, CNNs • Tools & Platforms: Power BI, Excel, Git/GitHub, Visual Studio Code, Jupyter • Non-Technical Skills: Leadership, Communication, Teamwork, Analytical Skills, Problem-Solving, Presentation Skills, Technical Documentation, Adaptability, Time Management CERTIFICATIONS • Artificial Intelligence: Machine Learning, Deep Learning, Data Engineer (N.S.D.C) • Programming: Python, Java, R, Git, C, Prompt Engineering"
  },
  {
    "resume_id": "RES_27",
    "filename": "Joel D’cruz.pdf",
    "raw_text": "Joel D’cruz  EDUCATION Qualification and Name of the Percentage/CGPA Year Institution M.Sc Computer Mahatma Gandhi - Science(Pursing) University Kottyam B.Sc Computer St. Paul’s College 49 . Arrakkal (H), Chebumukku, 682021 Science(2025) Kalamassery 9048499617 Plus Two(Higher Mary Matha H.S.S 69 joeldcruz96@gmail.com Secondary/12th) Thrikkakara 10th Mary Matha Public 79 LANGUAGES School Thrikkakara Malayalam English  PROJECT ScrapNet AI & Blockchain Driven Auto Recycling Network India’s Scrapping Policy requires old vehicles to be scrapped if they PROFILE • ABOUT ME fail tests. The current system faces illegal scrapping and poor tracking. ScrapNet uses blockchain and machine learning to ensure I'm a computer science student passionate about programming. I'm safe, transparent, and legal vehicle scrapping by connecting vehicle eager to apply my skills, stay owners, scrap dealers, and the RTO. updated with industry trends, and contribute to innovative projects. Seeking entrylevel opportunities to Online Job Finding Website start my career and make a positive impact. This project proposes a solution for managing job vacancies with a unique daily payment model, implemented through PHP and MySQL. Our system addresses this by providing a platform where job seekers can find opportunities that offer daily payments, ensuring faster access to earnings. Seminar Report Web-based phishing URL detection model using deep learning optimization techniques Advanced Travel Time Estimation: Integrating Weather Forecasting and Traffic Analysis for Real-Time Travel Assistance  Workshop Certificate for successfully completing python workshop provided by zoople Technologies Pvt.td.  SSKkills • Programming Languages : C, C++, Java, php. • Development : Html, Css, Javascript, Laravel. • Database : Mysql • Operating System : Linux Windows"
  },
  {
    "resume_id": "RES_29",
    "filename": "MERSHAN PETER.pdf",
    "raw_text": "MERSHAN PETER mershanpeter27@gmail.com https://www.linkedin.com/in/mershan-peter-m27 https://github.com/mershanpeter Kannur,Kerala +91 95390 17213 Profile Summary Enthusiastic Robotics and Automation student skilled in SolidWorks, PLC programming, and industrial automation. Experienced in integrating hardware and control systems with a strong foundation in Java, and C. Focused on developing smart, tech-driven design for innovative solutions. Education Oct 2022 –May 2026 MANAKULA VINAYAGAR INSTITUTE OF TECHNOLOGY ◦ CGPA: 8.73(upto 5th semester) B.Tech in Robotics and Automation (PURSUING) June 2021-March 2022 ST MICHAEL'S ANGLO INDIAN HSS Percentage: 89.25 HSC, Biology Science SSLC June 2019 - March 2020 Percentage:96 Technical Skills Programming Languages: Java, PLC ,C Tools: VSCode, SolidWorks, Arduino IDE, WPLSoft, Blue Prism , Easy EDA Projects MOPPER 2024 ◦ Role Played: Project Designer and Developer ◦ De veloped a robotic cleaning device, capable of autonomously navigating and cleaning an entire room based on a pre-defined environment, with automatic obstacle detection and path optimization. WATER MANAGEMENT SYSTEM USING IOT 2024 ◦ Role played: Team Leader, Hardware Developer ◦ Developed an IoT-based Water Management System that enables homeowners to monitor real-time water levels in overhead tanks through a mobile interface, displaying precise measurements on a meter scale. OBSTACLE AVOIDANCE ROBOT 2023 ◦ Role played: Individual Contributor ◦ Designed and developed an obstacle avoidance robot that autonomously navigates around obstacles, featuringBluetooth connectivity for seamless communication and remote control via a mobile phone. Non-Technical Skills ◦Leadership ◦ Adaptability ◦ Communication ◦ Time Management ◦ Team collaboration Certifications Management Development Programme on Advanced CAD/CAM/CAE (SolidWorks) – MSME Technology Centre, Puducherry Robotics and Artificial Intelligence Industrial Training Program - My Equation Java Programming – Amaze Institute of Animation and Technology Acheivements Completed Garnishing Talent Program from Eaton Power Quality Private limited in association with Confederation of Indian Industry(CII) Participated in SAEINDIA student convention for electricals and electronics in mobile robot. Participated in SAEINDIA student convention for electricals and electronics in Internet of things(IoT). Languages Known English ◦ Malayalam ◦ Tamil ◦ Hindi"
  },
  {
    "resume_id": "RES_30",
    "filename": "Mohammed Safwan PK.pdf",
    "raw_text": "MOHAMMED SAFWAN PK OFFICE ADMINISTRATOR Address: Malappuram, Kerala Phone: +91 9745934614 Email: safwanpkpnm@gmail.com SUMMARY Office Administrator with a Master of Business Administration and a strong foundation in business operations, administration, and financial coordination. Known for streamlining administrative processes, enhancing customer satisfaction, and supporting cross functional teams. Proficient in communication, problem-solving, and leadership, with a passion for creating efficient workplace systems. SKILLS Hard Skills : Office Administration | Coordination | Record Keeping | Data Entry | Document Control | Filing Systems | Customer Relationship Management | Report Preparation & Scheduling | Digital file organization | Calendar Coordination Soft Skills : Problem Solving | Communication | Interpersonal Skills | Team Coordination | Leadership | Reporting | Adaptability | Multitasking Technical Skills : Microsoft Word | Microsoft Excel | Microsoft PowerPoint ACADEMIC QUALIFICATION MBA in Travel & Tourism | 2023 to 2025 Mangalore University BA in Travel & Tourism | 2020 - 2023 University of Calicut ACHIEVEMENTS Consistently submitted academic assignments ahead of deadlines with high accuracy. Recognized for meticulous documentation and organization during project. PROJECTS Rail Tourism in India with Special Reference to Ooty Toy Train Conducted primary research on customer satisfaction and challenges, surveying travelers and analyzing service touchpoints across booking, boarding, and in-journey experience. Compiled findings into actionable recommendations to improve scheduling information, ticketing clarity, and on-ground assistance. Customer Satisfaction & Challenges Study Designed questionnaire, collected responses, and produced a summary report highlighting key pain points and improvement areas. Organized data in spreadsheets and created charts/tables to present insights for decision-making. LANGUAGES English | Hindi PERSONAL INFORMATION Gender : Male Date of Birth : 14/02/2001 Nationality : Indian"
  },
  {
    "resume_id": "RES_31",
    "filename": "MOHAMMED SHAMIL  M.pdf",
    "raw_text": "MOHAMMED LANGUAGES SHAMIL .M HINDI ENGLISH AI & ML ENGINEER MALAYALAM PROJECTS Fraud-Detection-Model-project Machine Learning Model for Detecting Credit Card Fraud 07/2025 mohammedshamilm17@gmail.com This project aims to develop a machine learning model to detect fraudulent financial transactions. Using 9207522676 supervised learning techniques on historical data, the MALAPPURAM ,KERALA , INDIA model identifies suspicious patterns and flags potential fraud. It helps enhance security in systems like online 17/03/2005 banking and credit card processing by enabling early MALE detection and prevention of fraudulent activities. github.com/mohammedshamilm78 90 Stock Price Prediction Forecasting Future Market Trends Using Machine linkedin.com/in/mohammed- Learning Techniques shamil-m-6334ba2b4 05/2025 This project focuses on predicting future stock prices using historical market data and machine learning techniques. By analyzing trends, patterns, and EDUCATION fluctuations in stock prices, the model aims to forecast future values with improved accuracy. Techniques such B.COM COMPUTER APPLICATION as time series analysis, linear regression, and deep INDIRA GANDHI ARTS AND SCIENCE learning models like LSTM (Long Short-Term Memory) COLLEGE are implemented to handle sequential data and capture 09/2022 – 05/2025 market behavior. The goal is to assist investors and ERNAKULAM, INDIA analysts in making informed decisions by providing data-driven stock predictions. DIPLOMA IN ARTIFICIAL INTELLIGENCE & MECHINE Sentiment Analysis Project LEARNING Detecting Emotions in Text with AI GITH GLOBAL INDIA TECHNO HUB 05/2025 04/2024 – 04/2025 This project uses machine learning and natural ERNAKULAM, INDIA language processing (NLP) techniques to analyze text data and classify it as positive, negative, or neutral, HIGHER SECONDARY EDUCATION helping understand public opinion and emotional tone GVHSS CHETTIYAMKINAR 03/2022 | MALAPPURAM, INDIA SECONDARY SCHOOL LEARNING FAROOK E M H S S 03/2020 | KOTTAKKAL, INDIA INTERESTS SKILLS FOOTBALL Python GYM Data science WATCHING MOVIES Mechine learning Listening songs Deep learning Video editing NLP Computer vision DECLARATION Business intelligence Data analysis I do hereby declare that all the Detail furnishedabove are ture to the best of Web scraping my knowledge Data visualization Numpy Pandas MOHAMMEDSHAMIL.M Math points MALAPPURAM, 15/7/2025 Java C programming Computerized Accounting HTML & Web Development Basics Database Management System (DBMS) Tally with GST MS Office Suite (Word, Excel, PowerPoint, Access) E-commerce Platforms ( Basics) Communication Skills Time Management Video editing Videography"
  },
  {
    "resume_id": "RES_32",
    "filename": "Mohammed Shammas MP.pdf",
    "raw_text": "Mohammed Shammas MP Moothedath Pullisheeri (H) Cheruvayoor (PO) Vazhakkad, Kondotty, Malappuram, Kerala, India pin:673645 9072722035| amsvkd1@gmail.com OBJECTIVE Ready to do any halal works for livelihood. My job should not be a barrier to the 5 time prayers in Islam 📌 Willing to service the society with my skills. Want to pursue a masters degree in UK 2025 September or 2026 January onwards. EXPERIENCE 25/03/2022 Sales man - Bestree Supermarket 28/07/2022 28/07/2022 Sales man - Mamatha Grand City 18/11/2022 05/2024 Magazine and newspaper controller - Bappu Musliyar Memorial Library 11/2024 2025 - Juma leadership 2025 Moopan's Masjid and Juma masjid Valayamkulam city For two fridays in the first and for one friday in the second 2020 - Prayer leadership 2025 Kannathumpara Juma masjid During Eid times only instead of the officials 04/2024 Leader of Wafy Students' Orbit - Vazhakkad - Wafy Students' Federation 04/2025 Orbit controlling according to the instructions from CIC and WSF Kerala State Committee 2023 - saaram_amsvkd account owner Continues Instagram Content writing and graphic designing 2023 - Academi Leader 2024 Bafakhy islamic and arts college Portion planning, Attendence Resister management 2020 - SIP Volunteer Vazhakkad Palliative Care Association Non-paid Volunteer in Students' Initiative in Palliative (SIP) Home Care visit along with nurses Caring Patients Fund Collection Day Camps for patients Networking April Field Worker 2025 - Darul Islam Al-Badriyya Fund Collection and Advertisements. EDUCATION 2018 SSLC G.H.S.S Vazhakkad 9A+ and 1A 2020 +2 BYK Govt. V.H.S.S Kadungathukundu 69% 2025 BA. English Language and Literature University of Calicut 58.5% SKILLS English language Arabic language 80% 80% Urdu language Malayalam Language 60% 80% Public interaction Content writing 60% 60% Data Entry WHO soft skills 60% 80% Leadership Management 40% 40% Behavioral Science Basic Mathematics 80% 80% Photography Vedio editing basics 40% 40% Football Goalkeeper Speech 80% 60% Islamic sciences Teaching 80% 60% IT skills(MS office, excel, Mobile graphic designing basics Powerpoint) 40% 40% PUBLICATIONS വിരൽ തുിെല മഷിതുികൾ A malayalam poem collection LANGUAGES Arabic English Urdu Malayalam Hindi ADDITIONAL INFORMATION Mohammed Shammas in Facebook mpmuhammedshammas in Instagram 9072722035 in WhatsApp 9072722035 in Telegram"
  },
  {
    "resume_id": "RES_33",
    "filename": "MOHAMMED SHIHAM C.pdf",
    "raw_text": "MOHAMMED SHIHAM C Student PROFILE EDUCATION student. LCC I consider myself a Android development responsible and orderly Java development person. I am looking forward to ICA COLLEGE GURUVAYROOR my first work 2020-2023 experience. Bsc computer science LANGUAGE Native malayalam CONTACT ME Advanced english-hindi 91+7034631686 COMPUTER SKILLS MSCY0077@gmail.com palarivattom, Java ernamkulam Rdbms Html WORK EXPERIENCE MM TRADING COMPANY I have been worked as an advertiser & iam an artist"
  },
  {
    "resume_id": "RES_34",
    "filename": "MUHAMMED SHIFAN S.pdf",
    "raw_text": "MUHAMMED SHIFAN S Kerala, India |Email: shifankichu100@gmail.com | +91 7902493387 | GitHub PROFILE Motivated and detail-oriented Bachelor of Computer Applications (BCA) student with hands-on experience in full- stack web development using the MERN (MongoDB, Express.js, React.js, Node.js) stack. Proficient in building responsive, dynamic, and scalable web applications. Strong foundation in data structures, algorithms, and software development principles. Passionate about clean code, continuous learning, and solving real-world problems through technology. Adept at working in team-based environments and delivering projects within deadlines. EDUCATION Diploma in MERN Stack Development Unique Occasio Tech , kerala Pursuing Bachelor Of Computer Application(BCA) completed 2024 mar gregorios college SKILLS Frontend : HTML, Tailwind CSS, Backend : Node.js, Express.js Version control : GitHub Javascript , React.js Database : MongoDB LANGUAGE English : Read, Write, Speak Malayalam : Read, Write, Speak Tamil : Speak Arabic : Read, Write Hindi : Read, Write PROJECTS E-commerce Website (In Progress) : Developing a full-stack e-commerce app using React, Node.js, Express, and MongoDB. Includes product listing, category filters, cart and checkout functionality, user auth with JWT, order summary, and a planned admin panel. Backend Authentication System : Built a secure authentication system using Node.js, Express, and JWT. Features include user registration and login, password hashing with bcrypt, token-based authentication, role- based access, session management, and error handling. Portfolio Website : A personal portfolio built with React to showcase projects and skills. Includes smooth animations, responsive design, and a clean UI. GitHub User Finder : React app that fetches and displays GitHub user data using the GitHub API. Includes real-time search and filter functionality. Travel Blog CRUD App : Developed a React-based travel blog with full CRUD operations and state management using Hooks. VS Code Website Clone : Recreated the official Visual Studio Code landing page using HTML and Tailwind CSS. Fully responsive and closely replicates the original design. Responsive HTML/CSS Projects : Developed five fully responsive websites using HTML and Tailwind CSS with a focus on clean user interfaces, modern layouts, and mobile-first responsiveness."
  },
  {
    "resume_id": "RES_35",
    "filename": "NANDHANA V A.pdf",
    "raw_text": "Nandhana V A Email: nandhana82003@gmail.com LinkedIn: https://www.linkedin.com/in/nandhana-v-a-/ Mobile: +91-8129232297 Github: github.com/nandhanava Summary Aspiring Data Analyst with a strong background in data science, and analytical problem-solving. Proficient in using data to uncover insights, improve decision-making, and solve real-world challenges. Highly motivated, detail-oriented, and eager to contribute to data-driven teams while expanding technical skills and industry knowledge. Technical Skills • Artificial intelligence: Machine Learning • Languages: Python,SQL • Frameworks: Numpy,Pandas,Scikit-learn • Tools: Git,GitHub • Platforms: Linux,Web,AWS,Windows Experience Luminar TechnoLab • Intern (Full-time) November 2024 - Present ◦ Machine Learning Model Development: Developed Machine learning models using supervised and unsupervised algorithms ◦ Exploratory Data Analysis (EDA): Explored datasets with Pandas and NumPy to drive data-informed decisions.. ◦ Dashboard Creation with Power BI: Built interactive Power BI dashboards used by internal teams to monitor and analyse KPIs. Projects • Habit Tracker - multimedia search engine (NLP, Search Engine, Web Crawlers, Multimedia Processing): (Work in progress) Research oriented, open source, search engine for bringing reverse multimedia search to small & mid scale enterprises. Tech: Python, NodeJS, Intel OpenVino Toolkit, Selenium, TensorFlow (October ’18) • Employee Attrition Analysis: Conducted a comprehensive analysis of employee attrition in a hospital organization, identifying key factors such as age, job satisfaction, and marital status that influence turnover, and developed strategic recommendations to enhance employee retention and satisfaction. Education St.Mary’s College,Thrissur Kerala, India • Bachelor of Computer Application June 2021 - May 2024 Courses: Operating Systems, Data Structures,Computer Networking Archivements • BCG- Data Science Job Simulation - July, 2024 • Python 101 for Data Science - May, 2025"
  },
  {
    "resume_id": "RES_36",
    "filename": "Sahva Ibrahim.pdf",
    "raw_text": "SAHVA IBRAHIM Computer graduated I am Highly motivated and dedicated bachelor of computer application graduate seeking a challenging position to apply my technical knowledge and skills in a professional work environment. Eager to contribute to the success of an organisation by leveraging my programming abilities, problem-solving skills, and passion for technology. EDUCATION CONTACT.. Bachelor Of Computer Application 8606887709 Sahrdaya College Of Advanced Studies Calicut University Sahvaibrahim16@gmail.com (2022-2025) Arimbathody house p o pady kodaly, Higher Studies thrissur, kerala GHSS Mupliyam - 91% ACHIEVEMENTS (2020 - 2021) High School Secured first price for sub-district level oppana SKHS Mattathur - 95% competition-2017 Secured first price for youth festival malayalam (2019) drama-2019 Successfully soft skills & Employability skills provided CERTIFICATES by cambridge english org. Was a part of National service scheme(NSS)-2022-24 Cambridge English Entry Level Certificate(06-05-2023) and successfully completed 7 days NSS camp -Achieved council of europe level (A2) Was a part of Junior Red Cross(JRC)-2018-20 Cyber Security Programme(2023-24) -Technova developing and traning-67% conducted orientation class on road safety and Block Chain and Cryptocurrencies(2023-23) traffic rules - Technova Tech-76% Industrial Visit Certificate(01-02-2024) LANGUAGES KNOW - Inker robotics solution Pvt. Ltd. Flutter internship(04-06-2025) Malayalam - Ocuiz skills academy IBM AI developer(01-06-2025) English -IBM certified EXPERTISE Hindhi C Programming Python programming Arabic Java programming AI & ML PHP &Java script REFERENCE HTML & CSS DR. JOY K.L Principal SKILLS.. sahrdaya college of advanced studies Communication skill Mobile : 9544086647 E-mail : joykl@sahrdayacas.ac.in Listening skill MR. RENJITH M Multi tasking HOD(Post Graduate Department of computer science) Problem solving skill sahrdaya college of advanced studies Mobile : 9961323222 Time management E-mail : renjithm222@gmail.com"
  },
  {
    "resume_id": "RES_37",
    "filename": "Sandra.pdf",
    "raw_text": "SANDRA B T E C H G R A D U A T E ( E C E ) CONTACT 7306516885 sandrakvinod06@gmail.com OBJECTIVE Near Csez, Kakkand Ernakulam As a dedicated and proactive Electronics and Communication Engineering graduate, I aim to leverage EDUCATION my strong foundation in programming, problem-solving, and core technical concepts to contribute effectively to 2023-2027 innovative software and IT solutions. With a keen interest FEDERAL INSTITUTE OF SCIENCE in technology and continuous learning, I aspire to build a AND TECHNOLOGY, dynamic career in a challenging environment that values ANGAMALY excellence, collaboration, and growth Electronics and Communication engineering INTERNSHIP 2022-2023 BHAVANS VIDYA MANDIR, Techmaghi, Kalamassery 15/06/2025-21/06/2025 ELAMAKKARA 7-Day Internship on Wireless Robotic Car with Class XII (PCMB) Arduino Embedded System organized by Techmaghi. The internship offered foundational 2019-2020 training in embedded systems and hands-on BHAVANS VIDYA MANDIR, experience with Arduino Uno. ELAMAKKARA Worked on programming, Tinkercad simulations, Class X (general) and hardware interfacing with LEDs, buzzers and LCDs. SKILLS PROJECT Hardworking Wireless robotic car controlled via arduino uno Teamwork Wireless robotic car controlled via Bluetooth using Time Management an Arduino Uno. Leadership A simple, remotely operated car that can move Effective Communication forward, backward, left, and right based on Critical Thinking commands sent from a smartphone or other Bluetooth-enabled device. LANGUAGES TECHNICAL SKILLS English Malayalam C programming Matlab, Scilab Arduino Projects"
  },
  {
    "resume_id": "RES_38",
    "filename": "Shaahul hamid.pdf",
    "raw_text": "SHAAHUL HAMID Email: shaahulhamid.kassim@gmail.com | Phone: +91-9074038842 | LinkedIn: linkedin.com/in/shaahul-hamid-5289a7205/ PROFESSIONAL SUMMARY Experienced Master’s in Computer Application (MCA) graduate with over a year of hands-on experience as a Software Test Engineer Trainer, having trained 1000+ students in Java, Manual, and Automation Testing.Proficient in testing frameworks, methodologies, and tools, adept at driving efficiency and effectiveness in the testing process. Eager to contribute expertise to a reputed company, skilled in collaborating with cross-functional teams and communicating technical concepts. WORK EXPERIENCE QSpiders - Software Testing Training Institute Bengaluru, Karnataka Software Testing Trainer Nov 2022 - Nov 2023 ● Training Excellence: Equipped over 1000 graduate students with proficient skills in Java programming, SQL database management, and both manual and automation testing techniques. ● Leadership in Quality Assurance: Directed teams in implementing robust quality assurance processes, enhancing testing efficiency, and ensuring high-quality deliverables, resulting in elevated client satisfaction. ● Internship & Mentoring Programs: Designed and oversaw internship initiatives, providing hands-on experience and mentorship to aspiring software professionals, fostering their growth and development. ● Tool Proficiency: Demonstrated expertise in utilising industry-standard tools such as Java, SQL, and Selenium automation framework to streamline software development and testing processes Amazon Development Centre Hyderabad, Telangana - Seller Support Associate Jun 2024 - Dec 2024 ( 6 month contract ) ● Investigation Associate: Worked as an Investigation Associate for the team comprising of 25, Investigating the quality and ensuring reliable, efficient review for the product enlisted in Amazon.in ● Contract based : Completed 6 months contract successfully, Ensuring good productivity and quality even while working remotely SKILLS ● Programming/Software Proficiency: C, C++, Java, Selenium, SQL, HTML, CSS ● Testing Proficiency: Manual Testing, Automation Testing, Writing Test Cases and Test Scenarios, Converting Test Cases into Automation Scripts, Scrum and Agile Methodology, Defect life cycle, Software Development Life Cycle (SDLC), Software Test Life Cycle (STLC), Browser Controlling Methods, Locators: Locating Web elements using appropriate strategy in automation testing ● Operating Systems: Linux, Windows EDUCATION ● Bharatiar University Coimbatore, Tamil Nadu Master’s In Computer Applications 2020 - 2022 ● AJK College of Arts & Science Coimbatore, Tamil Nadu Bachelor of Computer Applications 2017 – 2020"
  },
  {
    "resume_id": "RES_39",
    "filename": "SIJEESH S.pdf",
    "raw_text": "SIJEESH S 9544919662 Nanniode(po), palakkad-678534 https://github.com/Sijeesh-23 sijeesh.2392004.sijeesh@gmail.com ABOUT ME Enthusiastic and detail-oriented Full Stack Developer with a Bachelor's degree in Computer Applications from the University of Calicut. Adept at leveraging a diverse skill set in programming languages and web technologies to develop innovative software solutions. Committed to continuous learning in artificial intelligence and machine learning. Excellent problem-solving and communication skills, making me a valuable team player eager to contribute to dynamic development teams. EDUCATION 2022 - 2025 Bachelor of Computer Applications University of Calicut (BCA) ACADEMIC PROJECT Tourist Guide System Description: Developed a web-based application aimed at assisting tourists in navigating and exploring local attractions. Role: Full Stack Developer, responsible for both frontend and backend development. Technologies Used: HTML, CSS, JavaScript, PHP, MySQL. SKILLS Programming Languages: Java, Python, C Web Development: HTML, CSS, JavaScript, PHP Database Management: MySQL, SQLite Tools & Technologies: Git, Visual Studio Code, Eclipse Soft Skills: Problem-solving, Communication, Teamwork CERTIFICATIONS Diploma in Artificial Intelligence and Machine Learning - Youth Employability Skills Training (Government of India) AI and ML Certification - Srishti Innovative Educational Service (P) LTD Ethical Hacking Associate Certification - RedTeam Generative AI Certification - Microsoft Black and White Clean Professional A4 Resume Page 1 of 1"
  },
  {
    "resume_id": "RES_40",
    "filename": "SREEJITH S.pdf",
    "raw_text": "SREEJITH S Software Engineer +91 9188561940 sreejithsreekumar2002@gmail.com Alappuzha,kerala ABOUT ME MSc Computer Science graduate with expertise in programming, algorithms, and software development. Proficient in Python, Java, SQL, and web technologies, with academic experience in machine learning and database management. Eager to contribute to innovative projects in an entry-level software development role. EDUCATION Msc Computer science University of Kerala | 2023-2025 Bsc Electronics University of kerala| 2020-2023 WORK EXPERIENCE CODTECH IT SOLUTIONS | August 2024 - October 2024 Front End Develepor Intern Completed a virtual internship focused on web development, contributing to real-world projects. Enhanced skills in designing, coding, and testing web applications. Gained hands-on experience with web technologies and improved problem- solving abilities. CODSOFT | July 2024 - August 2024 Python Trainee Intern Completed a one-month virtual internship specializing in Python programming. Developed and implemented coding solutions for assigned tasks. Strengthened technical knowledge and gained experience working within an organizational structure TECHNICAL SKILLS SOFT SKILLS HTML5 SQL communication CSS3 Node Js Problem Solving Javascript Version Controls TeamWork Bootstrap python Django MS Office React Js Datastructures CERTIFICATIONS Generative AI Certification – Microsoft & LinkedIn Web Development Certification - Udemy Python Trainee Internship Certificate – Codsoft Web Development Internship Certificate – Codtech IT Solutions Digital Marketing Online Certification – Google IoT Certification – Cisco Career Edge – Young Professional Certification – TCS iON Excel Certification – OneRoadMap PROJECTS Weather App Built responsive app with real-time forecasts (HTML, CSS, JS, API). Added dark mode, search history, and dynamic icons. E-commerce Product Page Responsive product page with cart, quantity update, and cross- browser compatibility. Cyberbullying Detection ML-based detection using sentiment analysis, Django web interface. Multimodal Chatbot AI chatbot handling text & images (Python, LangChain, LLM), deployed on cloud. Automatic Vacuum Cleaner Arduino-based floor cleaning robot with obstacle detection. REFERENCE LinkedIn:https://www.linkedin.com/in/sreejith-s-52a826274 Github:https://github.com/Sj11156?tab=repositories"
  },
  {
    "resume_id": "RES_41",
    "filename": "Sruthi Satheesan.pdf",
    "raw_text": "Sruthi Satheesan CRA-123A, Pukkattu House, Near Kannoth Temple, Muppathadam (P.O), Aluva- 10 +918921196234 | sruthisreejith07@gmail.com Objective Dedicated and adaptable professional with a proactive attitude and the ability to learn quickly. Strong work ethic and effective communication skills. Eager to contribute to a dynamic team and support organisational goals. Education Course / Degree School / University Grade / Year Score M.Sc Bioinformatics Mahatma Gandhi University, 3.01 SGPA 2016- Kottayam 2018 B.Sc Biotechnology Mahatma Gandhi University, 7.85 CCPA 2013- Kottayam 2016 Higher Secondary Education (HSE) Govt. H S S Muppathadam 82.9% 2011- 2013 Secondary School Leaving Certificate Govt. H S S Muppathadam 85.5% 2011 (SSLC) Skills Programming language python Bioinformatics database HTML Decision making Problem solving Projects Detection And Sequence Comparison Of Adulterants In Ayurveda By Using rbcL PCR Barcodes (B.Sc Final Year Project) Guide: Dr. Sharrel Rebello, UniBiosys Biotech Research Labs, Kalamaserry Sarpagandha (Rauvolfiaserpentine) is a medicinal plant, beneficial in the treatment of hypertension, fever, psychogenic disorders and worm infections. The adulterants (Other species, different parts of the plant itself and some species of coffee plant) used in Sarpagandha products are detected by performing rbcL PCR barcodes. The study was carried out to detect the nucleotide sequences of different adulterants used for Sarpagandha. SYSTEMATIC CURATION AND DEVELOPMENT OF DATABASE OF PHARMACOGENOMIC VARIANTS AMONG SOUTH ASIAN, MIDDLE EAST AND AFRICAN POPULATION (M.Sc Final Year Project) Guide: Dr. VINOD SCARIA, Senior scientist, CSIR-IGIB Delhi Curated information from literature about various pharmacogenomics variants from South Asian, Middle East countries and African population, and compiled it into a database. This is the first one which contains the details about the pharmacogenomics variants with respect to South Asian, Middle East and African population. This will help researchers to focus on pharmacogenomics variants in these areas, and make beneficial changes to the drug therapy, with respect to the patients' genotype. Achievements & Awards Worked as trainee in CSIR-IGIB, Delhi for 5 months. Got 4th rank in M.Sc. Bioinformatics from MGU, Kottayam. Participated in water analysis programme conducted by Kerala Pollution Control Board at flood affected area on 2018. Languages English - Read, Write & Speak Hindi - Read, Write & Speak Malayalam - Read, Write & Speak Reference Shyam Mohan - U C College, Aluva Head of the Department of Biosciences shyammohan@uccollege.edu.in SRUTHI SATHEESAN"
  },
  {
    "resume_id": "RES_42",
    "filename": "STENIYA LIEONS.pdf",
    "raw_text": "STENIYA LIEONS +91 7736977628 SOFTWARE DEVELOPER Steniyalieons2002@gmail.com SUMMARY Motivated and Passionate Software Developer with a strong foundation in Python and hands-on experience from personal projects and coursework. Passionate about solving problems through code and eager to apply my skills in web development. PROFESSIONAL EXPERIENCE ▪ PYTHON INTERNSHIP 1 month - 2024 Zoople Technologies - Developing and maintaining web applications using Python, Django, and related technologies - Integrating third-party services and APIs - Writing custom Python code to extend Django applications - Developing RESTful web services and APIs(cid:31) TECHNICAL SKILLS ▪ PYTHON ▪ BOOTSTRAP ▪ JAVASCRIPT ▪ DJANGO ▪ HTML ▪ MY SQL ▪ CSS SOFT SKILLS ▪ COMMUNICATION SKILLS ▪ FLEXIBILITY ▪ PROBLEM-SOLVING ▪ CREATIVITY ▪ CRITICAL THINKING ▪ TEAMWORK ▪ TIME MANAGEMENT EDUCATION ▪ PYTHON FULLSTACK 1 month - 2024 Zoople Technologies ▪ BACHELOR OF COMMERCE IN FINANCE 2020 - 2023 Calicut University LANGUAGE ▪ ENGLISH ▪ MALAYALAM ▪ HINDI"
  },
  {
    "resume_id": "RES_43",
    "filename": "Vismin Krishna M.pdf",
    "raw_text": "VISMIN KRISHNA M CONTACT PROFESSIONAL SUMMARY +91 90741 25150 Enthusiastic and detail-oriented Computer Science and Engineering visminkrishnam@gmail.com undergraduate (B.Tech, 2025) with knowledge in Python, AI, Web Development, and Object Detection models. Skilled in applying innovative https://www.linkedin.com/in/vismi] solutions through academic projects, workshops, and internships. Recognized Thoppil Thanichal House, for leadership, problem-solving, and communication skills as College Captain Venpalavattom, Anayara P.O, (2024–2025). Passionate about AI, software development, and data-driven Trivandrum technologies, with proven ability to work on collaborative projects and adapt quickly to emerging tools. TECHNICAL SKILLS EDUCATION Programming Languages: Python, C, JavaScript APJ Abdul Kalam Technological University – Trivandrum Web Technologies: HTML, CSS, Web Development Basics Bachelor of Technology in Computer Science & Engineering John Cox Memorial CSI Institute of Technology, Trivandrum | 2021-2025 Domains: Artificial Intelligence, Object Detection Higher Secondary Education - Science (CBSE) SOFT SKILLS MGM Central Public School, Trivandrum | 2019 - 2021 Problem Solving Secondary School Education (CBSE) Critical Thinking MGM Central Public School, Trivandrum | 2018 - 2019 Communication EXPERIENCE Presentation Time Management Quick Learning Internship – Artificial Intelligence (Python) | Soften Technologies, Kochi (May 2023) LANGUAGES Internship – Web Development (Basics) | Keltron Knowledge Centre (May 2023 – June 2023) English Workshop – Data Science | NIT Calicut (21–22 Oct 2022) Malayalam PROJECTS Hindi Tamil Object Detection Using YOLOv10 HOBBIES & INTERESTS Implemented real-time drone detection system using YOLOv10 model, with enhanced ability to identify small objects in complex environments. Singing Idea Canvas Developed an online educational platform to enhance student learning by Reading providing a structured repository of project content. Teaching Generative Pre-trained Transformer (GPT) Sports Explored large language models for text understanding and generation, applying transformer-based deep learning concepts. REFERENCES ACHIEVEMENTS & LEADERSHIP Prof. Vishnukumar S. Head of Department, Dept. of CSE, John College Captain (2024–2025) – John Cox Memorial CSI Institute of Technology Cox First Prize – Solo Song (Cultural Fest) & Winner at multiple Inter-college Memorial CSI Institute of Technology, Competitions Trivandrum Recognized for leadership, event management, and academic contributions Phone: +91 9447144512 Email: Vishnusdev@gmail.com"
  },
  {
    "resume_id": "RES_44",
    "filename": "Yaseen Salim.pdf",
    "raw_text": "CONTACT Yaseen Salim  Mangattu house ODAKKACITY, KOOMBANPARA Po IDUKKI, Kerala, 685561  +918921584675  yaseensalim2005@gmail.com OBJECTIVE I seek challenging opportunities where I can fully use my skills for the success of the organization. EDUCATION 2020 Carmel Matha High School, Mangadav SSLC 2022 SNDP Higher Secondary School Adimaly PLUS TWO 2025 Al Azhar Arts And Science College, Thodupuzha Bachelor of Bachelor of Computer Applications SKILLS Communication Skill Foresighting Computer Problem Solving PROJECTS Own Road Vehicle Assistant Website Search for list of mechanic at any location or the nearby locations which will help them in an unexpected situations raised by the mechanical issues of their vehicles. Image Encryption The process of hiding images from unauthorized access using a secret key. LANGUAGES English Hindi Malayalam PERSONAL DETAILS Date of Birth : 22/04/2005 Nationality : Indian Gender : Male"
  }
]